In [1]:
print("Hi")

Hi

In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")

In [9]:
import seaborn as sns
%matplotlib inline

## Import Dataset

In [11]:
data = pd.read_csv(r"D:\mlproject\notebook\data\stud.csv")
data

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [13]:
df=data

## Checking Missing Values

In [15]:
df.isnull().sum()

gender                         0
race_ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

## Check DTypes

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race_ethnicity               1000 non-null   object
 2   parental_level_of_education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   math_score                   1000 non-null   int64
 6   reading_score                1000 non-null   int64
 7   writing_score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

## Check Duplicates

In [19]:
df.duplicated().sum()

np.int64(0)

## Checking unique values of each cloumn

In [22]:
df.nunique()

gender                          2
race_ethnicity                  5
parental_level_of_education     6
lunch                           2
test_preparation_course         2
math_score                     81
reading_score                  72
writing_score                  77
dtype: int64

## Statistics of the dataset
Numerical Values - (math_score, reading_score,writing_score)

In [27]:
df.describe()

       math_score  reading_score  writing_score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

## Columns

In [31]:
df.columns

Index(['gender', 'race_ethnicity', 'parental_level_of_education', 'lunch',
       'test_preparation_course', 'math_score', 'reading_score',
       'writing_score'],
      dtype='object')

## Exploring Data
Checking unique values

In [37]:
print(f"Categories of {df["gender"].unique()}")
print(f"Categories of {df["race_ethnicity"].unique()}")
print(f"Categories of {df["parental_level_of_education"].unique()}")
print(f"Categories of {df["lunch"].unique()}")
print(f"Categories of {df["test_preparation_course"].unique()}")

Categories of ['female' 'male']
Categories of ['group B' 'group C' 'group A' 'group D' 'group E']
Categories of ["bachelor's degree" 'some college' "master's degree" "associate's degree"
 'high school' 'some high school']
Categories of ['standard' 'free/reduced']
Categories of ['none' 'completed']

## Defining Numerical and Categorical Features

In [44]:
num_features = [feature for feature in df.columns if df[feature].dtype != "O"]
cat_features = [feature for feature in df.columns if df[feature].dtype == "O"]


print("We have {} Numerical Features{}".format(len(num_features),num_features))
print("We have {} Categorical features{}".format(len(cat_features),cat_features))

We have 3 Numerical Features['math_score', 'reading_score', 'writing_score']
We have 5 Categorical features['gender', 'race_ethnicity', 'parental_level_of_education', 'lunch', 'test_preparation_course']

In [45]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

## Adding columns as 'Total score' and 'Average'
feature engineering Aggregation

In [50]:
df["Total_score"] = df["math_score"] + df["reading_score"] + df["writing_score"]
df["Average"] = df["Total_score"]/3

In [51]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,Total_score,Average
0,female,group B,bachelor's degree,standard,none,72,72,74,218,72.666667
1,female,group C,some college,standard,completed,69,90,88,247,82.333333
2,female,group B,master's degree,standard,none,90,95,93,278,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,49.333333
4,male,group C,some college,standard,none,76,78,75,229,76.333333

In [1]:
import os

In [2]:
print(os.path.exists(r"D:\mlproject\notebook\data\stud.csv"))

True